s = 'Мама мыла раму!'
k = len(s)
print('Длина строки:', k)
print('Первый символ:', s[0])
print('1 способ. Последний символ:', s[k-1])
print('2 способ. Последний символ:', s[-1])
print('Первое слово:', s[0:4])
k_a = 0
for i in range(len(s)):
    if s[i] == 'а':
        k_a += 1   # k_a = k_a + 1 k_a++
print('1 способ. Количество букв а:', k_a)
print('2 способ. Количество букв а:', s.count('а'))
# s[0] = 'м' СТРОКУ ИЗМЕНИТЬ НЕЛЬЗЯ!!!
s = s.replace('Мама', 'мама')
print(s)
s = s.replace('м', 'М', 1)
print(s)
s = s.replace('Мама мыла', 'папа мыл')
print(s)
if 'папа' in s:
    print('да')
else:
    print('нет')